<template>
  <div>
    <x-header title="隐私声明"></x-header>
    <div class="ph3">
      <p class="mt3">我们非常重视对您的个人隐私保护，有时候我们需要某些信息才能为您提供您请求的服务，本隐私声明解释了这些情况下的数据收集和使用情况。</p>
      <h3 class="title">我们收集哪些信息</h3>
      <p>我们会收集你向我们提供的数据、你与网站之间的互动数据以及产品使用数据。 部分数据由你直接提供，其他数据则由我们通过你与产品的交互以及对产品的使用和
        体验收集而来。 我们收集的数据取决于你与网站互动的环境、你所做的选择，包括你的隐私设置以及你所使用的产品和功能。 我们还从第三方获取有关你的数据。</p>
      <h3 class="title">我们如何使用您的个人数据</h3>
      <p>我们使用收集的数据为你提供丰富的交互式体验。 我们使用数据的典型目的包括：</p>
      <ul class="pl3">
        <li>提供我们的产品，包括进行更新、保护和疑难解答，以及提供支持。 在需要使用数据来提供服务或执行你请求的交易时，还包括共享数据；</li>
        <li>改进和开发我们的产品；</li>
        <li>个性化我们的产品并提出建议。</li>
      </ul>
      <h3 class="title">关于免责说明</h3>
      <p>就下列相关事宜的发生，知性不承担任何法律责任：</p>
      <ul class="pl3">
        <li>由于您将用户密码告知他人或与他人共享注册帐户，由此导致的任何个人信息的泄漏，或其他非因知性原因导致的个人信息的泄漏；</li>
        <li>任何第三方根据知性各服务条款及声明中所列明的情况使用您的个人信息，由此所产生的纠纷；</li>
        <li>任何由于黑客攻击、电脑病毒侵入或政府管制而造成的暂时性网站关闭；</li>
        <li>因不可抗力导致的任何后果。</li>
      </ul>
    </div>
  </div>
</template>

<script>
  import { XHeader } from 'vux'

  export default {
    name: 'privacy',
    components: {XHeader}
  }
</script>

<style scoped>
  .title{
    color: #808080;
    margin-top: 1rem;
    margin-bottom: 1rem;
  }
</style>
